Foundation/extensions/global/template/webservice/payz/sendAndCommit.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:req="http://secure2.e-xact.com/vplug-in/transaction/rpc-enc/Request">
	<soapenv:Header/>
	<soapenv:Body>
		<req:SendAndCommit soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
			<SendAndCommitSource xsi:type="enc:Transaction"
				xmlns:enc="http://secure2.e-xact.com/vplug-in/transaction/rpc-enc/encodedTypes">
				<ExactID xsi:type="xsd:string"></ExactID>
				<Password xsi:type="xsd:string"></Password>
				<Transaction_Type xsi:type="xsd:string"></Transaction_Type>
				<!--Optional: -->
				<DollarAmount xsi:type="xsd:string"></DollarAmount>
				<!--Optional: -->
				<SurchargeAmount xsi:type="xsd:string"></SurchargeAmount>
				<!--Optional: -->
				<Card_Number xsi:type="xsd:string"></Card_Number>
				<!--Optional: -->
				<Transaction_Tag xsi:type="xsd:string"></Transaction_Tag>
				<!--Optional: -->
				<SplitTenderID xsi:type="xsd:string"></SplitTenderID>
				<!--Optional: -->
				<Track1 xsi:type="xsd:string"></Track1>
				<!--Optional: -->
				<Track2 xsi:type="xsd:string"></Track2>
				<!--Optional: -->
				<PAN xsi:type="xsd:string"></PAN>
				<!--Optional: -->
				<Authorization_Num xsi:type="xsd:string"></Authorization_Num>
				<!--Optional: -->
				<Expiry_Date xsi:type="xsd:string"></Expiry_Date>
				<!--Optional: -->
				<CardHoldersName xsi:type="xsd:string"></CardHoldersName>
				<!--Optional: -->
				<CVDCode xsi:type="xsd:string"></CVDCode>
				<!--Optional: -->
				<CVD_Presence_Ind xsi:type="xsd:string"></CVD_Presence_Ind>
				<!--Optional: -->
				<ZipCode xsi:type="xsd:string"></ZipCode>
				<!--Optional: -->
				<Tax1Amount xsi:type="xsd:string"></Tax1Amount>
				<!--Optional: -->
				<Tax1Number xsi:type="xsd:string"></Tax1Number>
				<!--Optional: -->
				<Tax2Amount xsi:type="xsd:string"></Tax2Amount>
				<!--Optional: -->
				<Tax2Number xsi:type="xsd:string"></Tax2Number>
				<!--Optional: -->
				<Secure_AuthRequired xsi:type="xsd:string"></Secure_AuthRequired>
				<!--Optional: -->
				<Secure_AuthResult xsi:type="xsd:string"></Secure_AuthResult>
				<!--Optional: -->
				<Ecommerce_Flag xsi:type="xsd:string"></Ecommerce_Flag>
				<!--Optional: -->
				<XID xsi:type="xsd:string"></XID>
				<!--Optional: -->
				<CAVV xsi:type="xsd:string"></CAVV>
				<!--Optional: -->
				<CAVV_Algorithm xsi:type="xsd:string"></CAVV_Algorithm>
				<!--Optional: -->
				<Reference_No xsi:type="xsd:string"></Reference_No>
				<!--Optional: -->
				<Customer_Ref xsi:type="xsd:string"></Customer_Ref>
				<!--Optional: -->
				<Reference_3 xsi:type="xsd:string"></Reference_3>
				<!--Optional: -->
				<Language xsi:type="xsd:string"></Language>
				<!--Optional: -->
				<Client_IP xsi:type="xsd:string"></Client_IP>
				<!--Optional: -->
				<Client_Email xsi:type="xsd:string"></Client_Email>
				<!--Optional: -->
				<User_Name xsi:type="xsd:string"></User_Name>
				<!--Optional: -->
				<Currency xsi:type="xsd:string"></Currency>
				<!--Optional: -->
				<PartialRedemption xsi:type="xsd:boolean"></PartialRedemption>
				<!--Optional: -->
				
				<!--Optional: -->
				<TransarmorToken xsi:type="xsd:string"></TransarmorToken>
				<!--Optional: -->
				<CardType xsi:type="xsd:string"></CardType>
				<!--Optional: -->
				<EAN xsi:type="xsd:string"></EAN>
				<!--Optional: -->
				<VirtualCard xsi:type="xsd:boolean"></VirtualCard>
				<!--Optional: -->
				<CardCost xsi:type="xsd:string"></CardCost>
				<!--Optional: -->
				<FraudSuspected xsi:type="xsd:string"></FraudSuspected>
				<!--Optional: -->
				<PaypalResponse xsi:type="enc:PaypalTransactionDetails">
					<!--Optional: -->
					<PayerID xsi:type="xsd:string"></PayerID>
					<!--Optional: -->
					<GrossAmountCurrencyID xsi:type="xsd:string"></GrossAmountCurrencyID>
					<Success xsi:type="xsd:boolean"></Success>
					<!--Optional: -->
					<Authorization xsi:type="xsd:string"></Authorization>
					<!--Optional: -->
					<Message xsi:type="xsd:string"></Message>
					<!--Optional: -->
					<CorrelationID xsi:type="xsd:string"></CorrelationID>
					<!--Optional: -->
					<Timestamp xsi:type="xsd:string"></Timestamp>
				</PaypalResponse>
				<!--Optional: -->
				<SoftDescriptor xsi:type="enc:SoftDescriptor_Type">
					<!--Optional: -->
					<DBAName xsi:type="xsd:string"></DBAName>
					<!--Optional: -->
					<Street xsi:type="xsd:string"></Street>
					<!--Optional: -->
					<City xsi:type="xsd:string"></City>
					<!--Optional: -->
					<Region xsi:type="xsd:string"></Region>
					<!--Optional: -->
					<PostalCode xsi:type="xsd:string"></PostalCode>
					<!--Optional: -->
					<CountryCode xsi:type="xsd:string"></CountryCode>
					<!--Optional: -->
					<MID xsi:type="xsd:string"></MID>
					<!--Optional: -->
					<MCC xsi:type="xsd:string"></MCC>
					<!--Optional: -->
					<MerchantContactInfo xsi:type="xsd:string"></MerchantContactInfo>
				</SoftDescriptor>
				<!--Optional: -->
				<Address xsi:type="enc:Address_Type">
					<!--Optional: -->
					<Address1 xsi:type="xsd:string"></Address1>
					<!--Optional: -->
					<Address2 xsi:type="xsd:string"></Address2>
					<!--Optional: -->
					<City xsi:type="xsd:string"></City>
					<!--Optional: -->
					<State xsi:type="xsd:string"></State>
					<!--Optional: -->
					<Zip xsi:type="xsd:string"></Zip>
					<!--Optional: -->
					<CountryCode xsi:type="xsd:string"></CountryCode>
					<!--Optional: -->
					<PhoneNumber xsi:type="xsd:string"></PhoneNumber>
					<!--Optional: -->
					<PhoneType xsi:type="xsd:string"></PhoneType>
				</Address>
				<!--Optional: -->
				<TPPID xsi:type="xsd:string"></TPPID>
				<!--Optional: -->
				<SplitShipmentNumber xsi:type="xsd:string"></SplitShipmentNumber>
				<!--Optional: -->
				<AmexFraud xsi:type="xsd:string"></AmexFraud>
				<!--Optional: -->
				<DynamicCurrency xsi:type="enc:DynamicCurrency">
					<OptedIn xsi:type="xsd:string"></OptedIn>
					<!--Optional: -->
					<RateResponseSignature xsi:type="xsd:string"></RateResponseSignature>
				</DynamicCurrency>
				<!--Optional: -->
				<DynamicPricing xsi:type="enc:DynamicPricing">
					<OptedIn xsi:type="xsd:string"></OptedIn>
					<!--Optional: -->
					<RateResponseSignature xsi:type="xsd:string"></RateResponseSignature>
				</DynamicPricing>
				<!--Optional: -->
				<FeeAmount xsi:type="xsd:string"></FeeAmount>
				<!--Optional: -->
				<VisaCheckout xsi:type="enc:VisaCheckout">
					<CallID xsi:type="xsd:string"></CallID>
					<!--Optional: -->
					<PromoCode xsi:type="xsd:string"></PromoCode>
				</VisaCheckout>
				<!--Optional: -->
				<PostDate xsi:type="xsd:string"></PostDate>
				<!--Optional: -->
				<OtherAmount xsi:type="xsd:string"></OtherAmount>
				<!--Optional: -->
				<GiftDepositAvailable xsi:type="xsd:string"></GiftDepositAvailable>
				<!--Optional: -->
				<SpecialPayment xsi:type="xsd:string"></SpecialPayment>
				<!--Optional: -->
				<WalletProviderID xsi:type="xsd:string"></WalletProviderID>
			</SendAndCommitSource>
		</req:SendAndCommit>
	</soapenv:Body>
</soapenv:Envelope>